{"keras_version": "2.1.2", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [5, 5], "name": "conv2d_1", "activation": "relu", "trainable": true, "bias_regularizer": null, "use_bias": true, "batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "padding": "valid", "kernel_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "name": "average_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_size": [5, 5], "name": "conv2d_2", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "rate": 0.25, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_3", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null, "filters": 128, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "rate": 0.25, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "trainable": true, "name": "dense_1", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 2048, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "rate": 0.5, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "name": "dense_2", "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 2, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}