{"backend": "tensorflow", "config": [{"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [7, 7], "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 64, 64, 1], "filters": 32, "padding": "valid", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_2", "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "filters": 64, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_3", "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "filters": 128, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_4", "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "filters": 128, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv2d_5", "bias_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "filters": 128, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"pool_size": [3, 3], "padding": "valid", "trainable": true, "strides": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "name": "dropout_3", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 2, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activation": "linear"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}], "keras_version": "2.1.2", "class_name": "Sequential"}