{"keras_version": "2.1.2", "config": [{"config": {"bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [7, 7], "activation": "relu", "name": "conv2d_1", "batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "padding": "valid", "bias_constraint": null, "use_bias": true, "filters": 32, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "activation": "relu", "name": "conv2d_2", "use_bias": true, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "filters": 64, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_3", "use_bias": true, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "filters": 128, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_4", "use_bias": true, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "filters": 128, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "name": "conv2d_5", "use_bias": true, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "filters": 128, "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "relu", "units": 2, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_6"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}